{
  "architectures": [
    "Rwkv6ForCausalLM"
  ],
  "auto_map": {
      "AutoConfig": "configuration_rwkv6.Rwkv6Config",
      "AutoModelForCausalLM": "modeling_rwkv6.Rwkv6ForCausalLM"
  },
  "attention_hidden_size": 5120,
  "bos_token_id": 0,
  "eos_token_id": 0,
  "head_size": 64,
  "head_size_divisor": 8,
  "hidden_size": 5120,
  "intermediate_size": null,
  "layer_norm_epsilon": 1e-05,
  "model_type": "rwkv6",
  "num_attention_heads": 80,
  "num_hidden_layers": 32,
  "rescale_every": 6,
  "tie_word_embeddings": false,
  "transformers_version": "4.37.1",
  "use_cache": true,
  "vocab_size": 65536
}
